In [1]:
import pandas as pd

In [2]:
# import library pandas
import pandas as pd

# read data property
property_data = pd.read_csv('property_data_2.csv')

# menampilkan semua data property
property_data

          lai  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0   100001000     104      PUTNAM            Y           3.0       1.0  900.0
1   100002000     197         LXT            N           1.0       1.0  900.0
2   100003000     199   LEXINGTON            N           1.0       1.0  850.0
3   100004000     201    berkeley            Y           1.0       1.0  700.0
4   100004000     201    berkeley            Y           1.0       1.0  700.0
5   100005000     203    BERKELEY            Y           3.0       2.0  975.0
6   100006000     207    Berkeley            Y           1.0       1.0  800.0
7   100007000     209  WASHINGTON            Y           2.0       1.0  950.0
8   100008000     213     TREMONT            Y           1.0       1.0  900.0
9   100009000     215     TREMONT            Y           1.0       2.0  900.0
10  100007000     209  WASHINGTON            Y           2.0       1.0  950.0

In [3]:
# Mengecek data duplicate
property_data.duplicated(keep=False)

0     False
1     False
2     False
3      True
4      True
5     False
6     False
7      True
8     False
9     False
10     True
dtype: bool

In [4]:
# Menyeleksi data yang dikategorikan sebagai data duplikat
property_data[property_data.duplicated(keep=False)]

          lai  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
3   100004000     201    berkeley            Y           1.0       1.0  700.0
4   100004000     201    berkeley            Y           1.0       1.0  700.0
7   100007000     209  WASHINGTON            Y           2.0       1.0  950.0
10  100007000     209  WASHINGTON            Y           2.0       1.0  950.0